Revit 2024 API
TemporaryViewModes.RemoveCustomization Method
 Removes all customized values for the TemporaryViewProperties mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public void RemoveCustomization()
Visual Basic
Public Sub RemoveCustomization
Visual C++
public:
void RemoveCustomization()
See Also
TemporaryViewModes Class
Autodesk.Revit.DB Namespace